app/views/posts/_form.html.erb

  <h1>TAGS</h1>
  <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"