app/controllers/posts_controller.rb

SELECT "tags".* FROM "tags"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @tags = Tag.all
    @post = Post.find(params[:id])

INSERT INTO "posts" ("user_id", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "post title"], ["content", "post content"], ["created_at", "2015-07-07 14:39:25.433217"], ["updated_at", "2015-07-07 14:39:25.433217"]]
---
  def create

    @post = Post.new(post_params)
    # post_tag_params[:tag_ids].each do |x|
    #   @post.tags << Tag.find(x) unless x == ""
    # end

    respond_to do |format|
      if @post.save